espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25a211f1920im56.h
#define EUSART0_NOT_EM2_CAPABLE                 0x0UL       /**> Not EM2 Capable instance */
#define RDMEM_FRC_BANK0_SIZE                    0x1000UL    /**> FRC_RAM_BANK0_SIZE */
#define RDMEM_FRC_BANK1_SIZE                    0x0UL       /**> FRC_RAM_BANK1_SIZE */
#define RDMEM_FRC_BANK2_SIZE                    0x0UL       /**> FRC_RAM_BANK2_SIZE */
#define RDMEM_FRC_BANK3_SIZE                    0x0UL       /**> FRC_RAM_BANK3_SIZE */
#define RDMEM_FRC_BANK4_SIZE                    0x0UL       /**> FRC_RAM_BANK4_SIZE */
#define RDMEM_FRC_BANK5_SIZE                    0x0UL       /**> FRC_RAM_BANK5_SIZE */
#define RDMEM_FRC_BANK6_SIZE                    0x0UL       /**> FRC_RAM_BANK6_SIZE */
#define RDMEM_FRC_BANK7_SIZE                    0x0UL       /**> FRC_RAM_BANK7_SIZE */
#define RDMEM_FRC_NUM_BANK                      0x1UL       /**> FRC_NUM_BANK */
#define RDMEM_FRC_RAMADDRBITS                   0xCUL       /**> FRC RAM ADDRBITS */
#define RDMEM_FRC_RAMADDRMINBITS                0xCUL       /**> FRC RAM address bits for one bank */
#define RDMEM_FRC_RAMECCADDR_WIDTH              0x20UL      /**> FRC RAM ECC Address width */
#define RDMEM_FRC_RAM_BWE_WIDTH                 0x27UL      /**> FRCRAM BWE width */
#define RDMEM_FRC_RAM_DATA_WIDTH                0x27UL      /**> FRC_RAM_DATA_WIDTH */
#define RDMEM_FRC_RAM_ECC_EN                    0x1UL       /**> FRC RAM ECCEN */
#define RDMEM_FRC_RAM_TOTAL_SIZE                0x1000UL    /**> FRC_RAM_TOTAL_SIZE */
#define RDMEM_SEQ_BANK0_SIZE                    0x2000UL    /**> SEQ_RAM_BANK0_SIZE */
#define RDMEM_SEQ_BANK1_SIZE                    0x2000UL    /**> SEQ_RAM_BANK1_SIZE */
#define RDMEM_SEQ_BANK2_SIZE                    0x2000UL    /**> SEQ_RAM_BANK2_SIZE */
#define RDMEM_SEQ_BANK3_SIZE                    0x0UL       /**> SEQ_RAM_BANK3_SIZE */
#define RDMEM_SEQ_BANK4_SIZE                    0x0UL       /**> SEQ_RAM_BANK4_SIZE */
#define RDMEM_SEQ_BANK5_SIZE                    0x0UL       /**> SEQ_RAM_BANK5_SIZE */
#define RDMEM_SEQ_BANK6_SIZE                    0x0UL       /**> SEQ_RAM_BANK6_SIZE */
#define RDMEM_SEQ_BANK7_SIZE                    0x0UL       /**> SEQ_RAM_BANK7_SIZE */
#define RDMEM_SEQ_NUM_BANK                      0x3UL       /**> SEQ_NUM_BANK */
#define RDMEM_SEQ_RAMADDRBITS                   0xFUL       /**> SEQ RAM ADDRBITS */
#define RDMEM_SEQ_RAMADDRMINBITS                0xDUL       /**> SEQ RAM address bits for one bank */
#define RDMEM_SEQ_RAMECCADDR_WIDTH              0x20UL      /**> SEQ RAM ECC Address width */
#define RDMEM_SEQ_RAM_BWE_WIDTH                 0x27UL      /**> SEQRAM BWE width */
#define RDMEM_SEQ_RAM_DATA_WIDTH                0x27UL      /**> SEQ_RAM_DATA_WIDTH */
#define RDMEM_SEQ_RAM_ECC_EN                    0x1UL       /**> SEQ RAM ECCEN */
#define RDMEM_SEQ_RAM_TOTAL_SIZE                0x6000UL    /**> SEQ_RAM_TOTAL_SIZE */
#define MPAHBRAM_AHB_DATA_WIDTH                 0x20UL      /**> Data width of the AHB interface */
#define MPAHBRAM_BANK0_SIZE                     0x4000UL    /**> Bank0 size */
#define MPAHBRAM_BANK10_SIZE                    0x0UL       /**> Bank10 size */
#define MPAHBRAM_BANK11_SIZE                    0x0UL       /**> Bank11 size */
#define MPAHBRAM_BANK12_SIZE                    0x0UL       /**> Bank12 size */
#define MPAHBRAM_BANK13_SIZE                    0x0UL       /**> Bank13 size */
#define MPAHBRAM_BANK14_SIZE                    0x0UL       /**> Bank14 size */
#define MPAHBRAM_BANK15_SIZE                    0x0UL       /**> Bank15 size */
#define MPAHBRAM_BANK16_SIZE                    0x0UL       /**> Bank16 size */
#define MPAHBRAM_BANK17_SIZE                    0x0UL       /**> Bank17 size */
#define MPAHBRAM_BANK18_SIZE                    0x0UL       /**> Bank18 size */
#define MPAHBRAM_BANK19_SIZE                    0x0UL       /**> Bank19 size */
#define MPAHBRAM_BANK1_SIZE                     0x4000UL    /**> Bank1 size */
#define MPAHBRAM_BANK20_SIZE                    0x0UL       /**> Bank20 size */
#define MPAHBRAM_BANK21_SIZE                    0x0UL       /**> Bank21 size */
#define MPAHBRAM_BANK22_SIZE                    0x0UL       /**> Bank22 size */
#define MPAHBRAM_BANK23_SIZE                    0x0UL       /**> Bank23 size */
#define MPAHBRAM_BANK24_SIZE                    0x0UL       /**> Bank24 size */
#define MPAHBRAM_BANK25_SIZE                    0x0UL       /**> Bank25 size */
#define MPAHBRAM_BANK26_SIZE                    0x0UL       /**> Bank26 size */
#define MPAHBRAM_BANK27_SIZE                    0x0UL       /**> Bank27 size */
#define MPAHBRAM_BANK28_SIZE                    0x0UL       /**> Bank28 size */
#define MPAHBRAM_BANK29_SIZE                    0x0UL       /**> Bank29 size */
#define MPAHBRAM_BANK2_SIZE                     0x4000UL    /**> Bank2 size */
#define MPAHBRAM_BANK30_SIZE                    0x0UL       /**> Bank30 size */
#define MPAHBRAM_BANK31_SIZE                    0x0UL       /**> Bank31 size */
#define MPAHBRAM_BANK3_SIZE                     0x4000UL    /**> Bank3 size */
#define MPAHBRAM_BANK4_SIZE                     0x0UL       /**> Bank4 size */
#define MPAHBRAM_BANK5_SIZE                     0x0UL       /**> Bank5 size */
#define MPAHBRAM_BANK6_SIZE                     0x0UL       /**> Bank6 size */
#define MPAHBRAM_BANK7_SIZE                     0x0UL       /**> Bank7 size */
#define MPAHBRAM_BANK8_SIZE                     0x0UL       /**> Bank8 size */
#define MPAHBRAM_BANK9_SIZE                     0x0UL       /**> Bank9 size */
#define MPAHBRAM_ECC_EXCLUDE                    0x0UL       /**> ECC exclude */
#define MPAHBRAM_MEM_SIZE                       0x10000UL   /**> Total memory size */
#define MPAHBRAM_NUM_BANKS                      0x4UL       /**> Number of physical SRAM banks */
#define MPAHBRAM_NUM_PORTS                      0x2UL       /**> Number of AHB slave ports */
#define MPAHBRAM_NUM_PORTS_IS_2                 0x1UL       /**> Boolean indicating if NUM_PORTS=2 */
#define MPAHBRAM_WAITSTATE_EXCLUDE              0x1UL       /**> Waitstate exclude */
#define AHBROM_BANK0_SIZE                       0x2000UL    /**> Bank0 Size */
#define AHBROM_BANK1_SIZE                       0x0UL       /**> Bank1 Size */
#define AHBROM_BANK2_SIZE                       0x0UL       /**> Bank2 Size */
#define AHBROM_BANK3_SIZE                       0x0UL       /**> Bank3 Size */
#define AHBROM_BANK4_SIZE                       0x0UL       /**> Bank4 Size */
#define AHBROM_BANK5_SIZE                       0x0UL       /**> Bank5 Size */
#define AHBROM_BANK6_SIZE                       0x0UL       /**> Bank6 Size */
#define AHBROM_BANK7_SIZE                       0x0UL       /**> Bank7 Size */
#define AHBROM_NUM_BANKS                        0x1UL       /**> Number of Banks */
#define AHBROM_SIZE                             0x2000UL    /**> Total size */

/* Instance macros for ACMP */
#define ACMP(n)                         (((n) == 0) ? ACMP0   \
                                         : ((n) == 1) ? ACMP1 \
                                         : 0x0UL)
#define ACMP_NUM(ref)                   (((ref) == ACMP0) ? 0   \
                                         : ((ref) == ACMP1) ? 1 \
                                         : -1)
#define ACMP_DAC_INPUT(n)               (((n) == 0) ? ACMP0_DAC_INPUT   \
                                         : ((n) == 1) ? ACMP1_DAC_INPUT \
                                         : 0x0UL)
#define ACMP_EXT_OVR_IF(n)              (((n) == 0) ? ACMP0_EXT_OVR_IF   \
                                         : ((n) == 1) ? ACMP1_EXT_OVR_IF \
                                         : 0x0UL)

